package com.tencent.fskin.demo

import android.os.Bundle
import com.tencent.fskin.demo.base.BaseActivity
import kotlinx.android.synthetic.main.activity_article_detail.*

class ArticleDetailActivity : BaseActivity() {

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)

        setTitle("文章详情")

        setContentView(R.layout.activity_article_detail)



        text.text = "1 月 25 日早上，人民日报公众号突然发布了一篇直播答题的预告文章，并介绍玩法，只要关注人民日报微信，在菜单栏「领复活卡」，就可以在芝士超人答题平台获得三张复活卡。当晚，最终吸引了近 340 万人同时在线答题。\n" +
                "\n" +
                "「我撒币，我乐意」，这场轰轰烈烈的直播问答究竟有多火？连人民日报也已经加入战局。人民日报和芝士超人的直播答题合作早在 1 月 13 日就已开始，第一场的奖金池为 101 万，而最新场次的总奖金已经升级到 300 万。另一个直播答题平台西瓜视频旗下的「百万英雄」甚至刷新行业新高，单场奖金冲至 500 万。\n" +
                "\n" +
                "合作之初，双方除了真金白银的投入，还包括人民日报客户端与芝士超人互换开屏，主要在 App 平台间实现流量共享。而如今，人民日报也开始转向将微信公众号用户引入 App 当中。\n" +
                "\n" +
                "事实上，在直播答题 App 甚嚣尘上的幕后，微信成为了各家争夺的流量池。所有平台都把引导微信分享、获得复活机会，作为了拉升用户量的重要手段。\n" +
                "\n" +
                "但这只不过是一个开始。与此同时，微信内的直播答题小程序也已纷然而至。\n" +
                "\n" +
                "1 月 18 日晚 8 点，新世相读书会上线了第一款直播答题小程序「百万黄金屋」，当晚 10 万元的奖金吸引了 21 万人上线参与。此后，「冲顶大会」、「百万英雄」相继开发了各自的小程序。\n" +
                "\n" +
                "知识问答的大火，还让已经成为现象级小程序游戏的「头脑王者」持续火爆。尽管，在具体玩法方面，「头脑王者」仍然与撒币模式存在较大差异，但用户对知识问答的兴趣却被无限激发。\n" +
                "\n" +
                "知乎与「头脑王者」合作的「知乎赛季」从 2017 年 12 月 26 日就已经启动。但在进入 2018 年之后，开始吸引了越发广泛的关注。双方围绕「知乎日报」公众号、「头脑王者」小程序、「知乎热榜」小程序开展流量传递，很快便让「知乎热榜」从众多内容小程序中脱颖而出。\n" +
                "\n" +
                "App 的黄昏冲顶\n" +
                "移动互联网之争早已有了定局。处于 App 诸神的黄昏，面对一个日趋固化的应用市场，不得不说，知识直播仍然掀起了不小的浪花。\n" +
                "\n" +
                "在此之前，除了不断更迭的手游，很难有某种类型 App 会引发如此强烈的用户狂热。而 App 获取单个用户的成本一路攀升到了数百元，即使直接付费给用户也似乎无济于事。\n" +
                "\n" +
                "直播问答可以说解决了获客成本、下载意愿这两个关键问题。冲顶大会自上线以来，下载量不断走高，1 月 19 日的安卓用户日下载量达到迄今最高的 325 万；西瓜视频在 1 月 18 日和 1 月 19 日更是连续创下了 6000 万左右的下载量。"
    }
}